app/views/homes/book_search.html.erb

SELECT "books".* FROM "books" WHERE (category LIKE'%test%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
        <td class="favorite-btn_<%= book.id %>"><%= render "favorites/favorite-btn", book: book %></td>
        <td class="comments-count">コメント数: <%= book.book_comments.count %></td>