app/controllers/books_controller.rb

  def index
    @books = Book.all
    @book = Book.new
    @books = Book.all.order(params[:sort])
    to  = Time.current.at_end_of_day
    from  = (to - 6.day).at_beginning_of_day
    @books = Book.includes(:favorited_users).
      sort {|a,b|
        b.favorited_users.includes(:favorites).where(created_at: from...to).size <=>
        a.favorited_users.includes(:favorites).where(created_at: from...to).size
---
SELECT "books".* FROM "books" ORDER BY rate DESC
SELECT "books".* FROM "books"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 3], ["created_at", "2021-09-02 00:00:00"], ["created_at", "2021-09-08 23:59:59.999999"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?)  [["book_id", 1], ["book_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 2], ["created_at", "2021-09-02 00:00:00"], ["created_at", "2021-09-08 23:59:59.999999"]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate", "category") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "test1"], ["body", "test1"], ["user_id", 1], ["created_at", "2021-09-06 13:45:38.490774"], ["updated_at", "2021-09-06 13:45:38.490774"], ["rate", 5.0], ["category", "test"]]
SELECT "books".* FROM "books"