app/controllers/messages_controller.rb

SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" = ?  [["user_id", 3], ["room_id", 1]]
INSERT INTO "messages" ("user_id", "room_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["room_id", 1], ["message", "test"], ["created_at", "2021-09-07 09:02:50.844310"], ["updated_at", "2021-09-07 09:02:50.844310"]]
---
  def create
    if UserRoom.where(user_id: current_user.id, room_id: params[:message][:room_id]).present?
      @message = Message.create(params.require(:message).permit(:user_id, :room_id, :message).merge(user_id: current_user.id))