app/controllers/rooms_controller.rb

  def create
    @room = Room.create
    @entry1 = UserRoom.create(user_id: current_user.id, room_id: @room.id)
    @entry2 = UserRoom.create(params.require(:user_room).permit(:user_id, :room_id).merge(room_id: @room.id))
---
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-09-07 08:55:38.832961"], ["updated_at", "2021-09-07 08:55:38.832961"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["room_id", 1], ["created_at", "2021-09-07 08:55:38.848233"], ["updated_at", "2021-09-07 08:55:38.848233"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["room_id", 1], ["created_at", "2021-09-07 08:55:38.859325"], ["updated_at", "2021-09-07 08:55:38.859325"]]

  def show
    @room = Room.find(params[:id])
    if UserRoom.where(user_id: current_user.id,room_id: @room.id).present?
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" = ?  [["user_id", 4], ["room_id", 5]]