app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new

    @user = User.find(params[:id])
    @currentUserRoom = UserRoom.where(user_id: current_user.id)
    @receiveUser = UserRoom.where(user_id: @user.id)
    unless @user.id == current_user.id
      @currentUserRoom.each do |cu|
        @receiveUser.each do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 3]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 4]]