app/models/user.rb

INSERT INTO "relationships" ("created_at", "updated_at", "follower_id", "followed_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-09-07 08:52:27.993535"], ["updated_at", "2021-09-07 08:52:27.993535"], ["follower_id", 4], ["followed_id", 3]]
---
  def follow(user_id)
    relationships.create(followed_id: user_id)